[{
  "_id": {
    "$oid": "6694c592fc1c9b04c930627c"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Thông tin về các yêu cầu chương trình học:</p>\n<p></p>\n<p>Giới thiệu về các yêu cầu chương trình học bao gồm các môn bắt buộc, các môn tự chọn, và các môn tiên quyết.</p>\n<p>Cung cấp thông tin chi tiết về cấu trúc chương trình học, các lựa chọn và những môn học cần thiết để hoàn thành chương trình.</p>\n<p>Hướng dẫn sử dụng hệ thống đăng ký môn học:</p>\n<p></p>\n<p>Các sinh viên mới thường được hướng dẫn cách sử dụng hệ thống đăng ký môn học trực tuyến của trường.</p>\n<p>Giới thiệu về các chức năng cơ bản của hệ thống, bao gồm cách tìm kiếm môn học, xem lịch học, thêm/xóa môn học, và xem thông tin chi tiết về từng môn.</p>\n<p>Lịch trình đăng ký và thời hạn quan trọng:</p>\n<p></p>\n<p>Cung cấp lịch trình đăng ký môn học và các thời hạn quan trọng như ngày mở/closed đăng ký, ngày thay đổi môn học, và ngày bổ sung môn học.</p>\n<p>Nhắc nhở sinh viên về tầm quan trọng của việc đăng ký đúng thời hạn để tránh tình trạng không đủ chỗ hoặc mất cơ hội đăng ký môn học mong muốn.</p>\n<p>Các tài liệu hướng dẫn và nguồn thông tin:</p>\n<p></p>\n<p>Cung cấp các tài liệu hướng dẫn chi tiết như sách hướng dẫn sinh viên, các bản mô tả chương trình học, và các nguồn thông tin trên trang web của trường.</p>\n<p>Giới thiệu về các dịch vụ hỗ trợ như các buổi hướng dẫn đăng ký môn học, hỗ trợ từ cố vấn học tập và phòng đào tạo.</p>\n<p>Hỗ trợ và câu hỏi thường gặp:</p>\n<p></p>\n<p>Cung cấp thông tin về cách liên hệ và nhận hỗ trợ từ phía trường trong quá trình đăng ký môn học.</p>\n<p>Giới thiệu về các câu hỏi thường gặp và các vấn đề phổ biến liên quan đến đăng ký môn học để giúp sinh viên tự giải quyết các vấn đề cơ bản.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:45:38.725Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c5befc1c9b04c9306296"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Cách thức sử dụng hệ thống đăng ký môn học online của trường như thế nào?</p>\n",
  "sender": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:46:22.481Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c5ebfc1c9b04c93062a6"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Đăng nhập vào hệ thống:</p>\n<p></p>\n<p>Truy cập vào trang web của trường và tìm đến phần đăng nhập vào hệ thống đăng ký môn học. Thường thì đây là một phần của hệ thống quản lý sinh viên hoặc hệ thống học tập trực tuyến của trường.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:47:07.337Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c5fefc1c9b04c93062ab"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Tìm kiếm môn học:</p>\n<p>Sau khi đăng nhập thành công, bạn có thể sử dụng chức năng tìm kiếm để tìm các môn học mà bạn muốn đăng ký. Các môn học thường được phân loại theo các khoa, chương trình hoặc học kỳ.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:47:26.298Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c622fc1c9b04c93062b0"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Thêm/xóa môn học:</p>\n<p></p>\n<p>Sau khi tìm thấy môn học cần đăng ký, bạn có thể chọn môn học đó và thêm vào lịch học của bạn bằng cách nhấn vào nút \"Thêm môn\" hoặc tương tự.</p>\n<p>Nếu bạn muốn thay đổi lịch học của mình, bạn có thể xóa môn học bằng cách chọn môn học và nhấn vào nút \"Xóa môn\".</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:48:02.516Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c632fc1c9b04c93062b5"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Xem và chỉnh sửa lịch học:</p>\n<p></p>\n<p>Hệ thống thường cung cấp cho bạn xem lại lịch học sau khi bạn đã thêm các môn học. Bạn có thể xem thông tin chi tiết về thời gian, địa điểm, và giảng viên của từng môn học.</p>\n<p>Nếu cần thiết, bạn có thể điều chỉnh lịch học bằng cách thay đổi các môn học đã đăng ký.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:48:18.426Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c63bfc1c9b04c93062ba"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Lưu ý các thời hạn và thông báo:</p>\n<p></p>\n<p>Hệ thống thường cung cấp các thông báo về các thời hạn quan trọng như thời gian mở/closed đăng ký, thời gian thay đổi môn học và các lịch trình học tập khác.</p>\n<p>Đảm bảo bạn tuân thủ các thời hạn này để đảm bảo việc đăng ký môn học diễn ra một cách suôn sẻ và không bị lỡ hẹn.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:48:27.962Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c64cfc1c9b04c93062bf"
  },
  "conversation": {
    "$oid": "6694c592fc1c9b04c930627a"
  },
  "content": "<p>Lưu trữ thông tin và tài liệu hỗ trợ:</p>\n<p></p>\n<p>Bạn có thể lưu trữ và in ra các thông tin đăng ký môn học của mình để sử dụng làm tài liệu tham khảo trong quá trình học tập.</p>\n",
  "sender": {
    "$oid": "6693c4db0615bc677a88bad2"
  },
  "viewed": false,
  "createdAt": {
    "$date": "2024-07-15T06:48:44.447Z"
  },
  "__v": 0
}]