[{
  "_id": {
    "$oid": "6694aed1c368e7498824fbcd"
  },
  "title": "Quy trình đăng ký môn học của sinh viên",
  "content": "<p>Quy trình đăng ký môn học của sinh viên như thế nào và có những yêu cầu gì tại trường bạn?</p>\n",
  "file": {
    "ref": "questions/nnc686vFNSljIywvAsn3H.jpg",
    "url": "https://firebasestorage.googleapis.com/v0/b/student-consulting-cb426.appspot.com/o/questions%2Fnnc686vFNSljIywvAsn3H.jpg?alt=media&token=26acd935-7a1e-4274-83ac-6254c3526202"
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Thông tin và lịch trình đăng ký: Trường cung cấp thông tin về thời gian mở đăng ký môn học, các hạn chót và lịch trình cụ thể.</p>\n<p></p>\n<p>Xem và lựa chọn môn học: Sinh viên truy cập hệ thống đăng ký trực tuyến của trường để xem danh sách các môn học được mở trong học kỳ đó. Họ có thể tìm kiếm thông tin về từng môn học như giảng viên, thời gian học, yêu cầu tiên quyết (nếu có), và số lượng chỗ còn lại.</p>\n<p></p>\n<p>Đăng ký môn học: Sinh viên chọn các môn học mà họ muốn đăng ký thông qua hệ thống online. Họ có thể có sự lựa chọn về lịch học và sự phối hợp giữa các môn học.</p>\n<p></p>\n<p>Xác nhận và sửa đổi đăng ký: Sau khi đăng ký, hệ thống sẽ cho phép sinh viên xem lại và xác nhận các môn học đã đăng ký. Họ cũng có thể có thời gian để chỉnh sửa đăng ký nếu cần thiết.</p>\n<p></p>\n<p>Xác nhận đăng ký từ phía trường: Sau khi sinh viên xác nhận đăng ký, trường sẽ xử lý và xác nhận lại danh sách môn học của từng sinh viên.</p>\n",
    "file": {
      "ref": "answers/v2Iyz6smV19-XRaBPfD4w.jpg",
      "url": "https://firebasestorage.googleapis.com/v0/b/student-consulting-cb426.appspot.com/o/answers%2Fv2Iyz6smV19-XRaBPfD4w.jpg?alt=media&token=1f3df912-ce53-43ba-9dcc-5a56d085c3e8"
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T05:46:54.079Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:08:33.008Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694af28c368e7498824fbf4"
  },
  "title": "Thủ tục đăng ký môn học",
  "content": "<p>Sinh viên cần làm gì để hoàn tất thủ tục đăng ký môn học tại trường của bạn?</p>\n",
  "file": {
    "ref": "questions/udkl0E2MPnRbl71aIvfJR.jpg",
    "url": "https://firebasestorage.googleapis.com/v0/b/student-consulting-cb426.appspot.com/o/questions%2Fudkl0E2MPnRbl71aIvfJR.jpg?alt=media&token=ecec93db-e9a2-4ba2-bdce-7f2ffd5d8944"
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Truy cập vào hệ thống đăng ký môn học của trường, thường là trực tuyến.</p>\n<p>Xem và lựa chọn các môn học mà sinh viên muốn đăng ký trong học kỳ đó.</p>\n<p>Đăng ký các môn học theo lịch trình và quy định được cung cấp.</p>\n<p>Xác nhận và kiểm tra lại danh sách môn học đã đăng ký.</p>\n<p>Theo dõi thông báo từ phía trường để biết về xác nhận và các bước tiếp theo nếu cần.</p>\n",
    "file": {
      "ref": "answers/VIMVapxYqHsBXxRXpE8EZ.jpg",
      "url": "https://firebasestorage.googleapis.com/v0/b/student-consulting-cb426.appspot.com/o/answers%2FVIMVapxYqHsBXxRXpE8EZ.jpg?alt=media&token=84fc24b0-dd0e-47c4-8971-1c98c548139d"
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T05:49:56.965Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:10:00.959Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694af3dc368e7498824fbfc"
  },
  "title": "Thời gian đăng ký môn học",
  "content": "<p>Thời gian đăng ký môn học là bao lâu và có những giai đoạn nào quan trọng?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Thời gian mở đăng ký: Là thời điểm mà hệ thống đăng ký môn học của trường mở cửa để sinh viên bắt đầu xem và đăng ký các môn học cho học kỳ tiếp theo.</p>\n<p></p>\n<p>Thời hạn đăng ký: Là thời điểm cuối cùng mà sinh viên phải hoàn thành việc đăng ký môn học. Việc đăng ký sau thời hạn này có thể không được chấp nhận hoặc sẽ bị áp đặt các hạn chế.</p>\n<p></p>\n<p>Giai đoạn xác nhận và chỉnh sửa: Sau khi đăng ký, sinh viên thường có một thời gian ngắn để xác nhận lại danh sách môn học và có thể sửa đổi nếu cần thiết.</p>\n<p></p>\n<p>Xử lý đăng ký từ phía trường: Sau khi sinh viên xác nhận đăng ký, trường sẽ xử lý và xác nhận lại danh sách môn học của từng sinh viên.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T05:53:47.266Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:10:21.751Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694afeec368e7498824fca4"
  },
  "title": "Hạn chế đăng ký môn học",
  "content": "<p>Có những hạn chế nào đối với việc đăng ký môn học mà sinh viên cần phải biết?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Số lượng tối đa môn học: Trường có thể áp đặt một số giới hạn về số lượng tối đa môn học mà sinh viên có thể đăng ký trong một học kỳ. Điều này nhằm đảm bảo sinh viên có thể chủ động trong việc lựa chọn môn học và không quá tải.</p>\n<p></p>\n<p>Yêu cầu tiên quyết: Một số môn học có thể yêu cầu sinh viên đã hoàn thành môn học tiên quyết trước đó để có thể đăng ký. Sinh viên cần kiểm tra và đảm bảo đã đáp ứng đủ các yêu cầu này trước khi đăng ký môn học.</p>\n<p></p>\n<p>Thời hạn đăng ký: Thường có một thời hạn cụ thể mà sinh viên phải hoàn thành việc đăng ký môn học. Đăng ký sau thời hạn này có thể dẫn đến không được chấp nhận hoặc phải đối mặt với các hạn chế và phí phạt.</p>\n<p></p>\n<p>Quy định về thay đổi đăng ký: Sau khi đã xác nhận đăng ký, các trường có thể áp đặt các hạn chế về việc thay đổi môn học, như chỉ được phép thực hiện thay đổi trong một khoảng thời gian nhất định và có sự chấp thuận từ phía giáo vụ.</p>\n<p></p>\n<p>Các yêu cầu đặc biệt: Ngoài những hạn chế cơ bản, có thể có các yêu cầu khác như yêu cầu chứng minh thêm về nhu cầu học tập hay các yêu cầu đặc biệt khác do từng trường đưa ra.</p>\n",
    "file": {
      "ref": "answers/nmh8U_3oRUqWzpj35PRZ5.jpg",
      "url": "https://firebasestorage.googleapis.com/v0/b/student-consulting-cb426.appspot.com/o/answers%2Fnmh8U_3oRUqWzpj35PRZ5.jpg?alt=media&token=5c4b1b38-dbd4-4169-8e42-34f6958604d5"
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T05:55:52.162Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:13:18.760Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b1373683dd8a9c44ecaf"
  },
  "title": "Thay đổi đăng ký môn học",
  "content": "<p>Quy trình và điều kiện để thay đổi đăng ký môn học là gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Xem xét thời gian thay đổi: Trước tiên, sinh viên cần kiểm tra xem trường có đưa ra thời gian cụ thể cho việc thay đổi đăng ký môn học hay không. Thời gian này thường được quy định rõ ràng để đảm bảo việc quản lý lớp học và tài nguyên của trường.</p>\n<p></p>\n<p>Đăng nhập vào hệ thống đăng ký môn học: Sinh viên cần đăng nhập vào hệ thống đăng ký môn học của trường, thường là một hệ thống trực tuyến, để thực hiện thay đổi. Họ có thể cần sử dụng tên đăng nhập và mật khẩu đã được cấp từ trường.</p>\n<p></p>\n<p>Thực hiện thay đổi: Sau khi truy cập vào hệ thống, sinh viên chọn tùy chọn thay đổi đăng ký môn học và chọn các môn học mà họ muốn thay đổi. Thao tác này thường gồm việc xóa môn học hiện tại và thêm môn học mới vào danh sách đăng ký của mình.</p>\n<p></p>\n<p>Xác nhận và lưu ý các giới hạn: Sau khi thực hiện thay đổi, sinh viên cần xác nhận lại danh sách môn học đã thay đổi và lưu ý các giới hạn về số tín chỉ, yêu cầu tiên quyết hoặc các hạn chế khác mà trường có thể áp đặt.</p>\n<p></p>\n<p>Phê duyệt từ phía trường (nếu cần): Tại một số trường, việc thay đổi đăng ký môn học có thể yêu cầu sự phê duyệt từ phía giáo vụ. Sinh viên cần kiểm tra và tuân thủ các quy định này để tránh trục trặc trong quá trình thay đổi.</p>\n<p></p>\n<p>Theo dõi thông báo: Sinh viên nên theo dõi thông báo từ hệ thống đăng ký hoặc từ phía giáo vụ để đảm bảo rằng thay đổi đăng ký đã được xử lý và xác nhận.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:11:12.909Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:18:47.206Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b1563683dd8a9c44ece6"
  },
  "title": "Môn học bắt buộc và môn học tự chọn",
  "content": "<p>Sự khác biệt giữa môn học bắt buộc và môn học tự chọn là gì? Sinh viên cần chú ý những gì khi đăng ký mỗi loại môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Môn học bắt buộc:</p>\n<p></p>\n<p>Đây là những môn học mà sinh viên phải học và hoàn thành để đạt được các yêu cầu chương trình học tập của khóa học hay ngành học.</p>\n<p>Thường các môn học bắt buộc được xây dựng dựa trên những kiến thức cơ bản và nền tảng quan trọng cho ngành học cụ thể.</p>\n<p>Sinh viên không có sự lựa chọn nếu không có yêu cầu đặc biệt từ giáo viên hướng dẫn hoặc quản lý chương trình học tập.</p>\n<p>Môn học tự chọn:</p>\n<p></p>\n<p>Đây là những môn học mà sinh viên có thể lựa chọn để thỏa mãn các yêu cầu không bắt buộc hoặc để tăng cường chuyên môn trong lĩnh vực học tập của mình.</p>\n<p>Thường các môn học tự chọn cung cấp sự linh hoạt cho sinh viên trong việc tùy chọn các chủ đề, chương trình học hoặc phương pháp giảng dạy.</p>\n<p>Sinh viên có thể lựa chọn môn học tự chọn dựa trên sở thích cá nhân, mục tiêu nghề nghiệp hoặc để đi sâu vào một lĩnh vực cụ thể hơn.</p>\n<p>Những điều cần chú ý khi đăng ký mỗi loại môn học:</p>\n<p></p>\n<p>Môn học bắt buộc: Sinh viên cần chắc chắn rằng họ đăng ký và hoàn thành các môn học bắt buộc theo lịch trình và yêu cầu của chương trình học tập. Việc không hoàn thành các môn học này có thể ảnh hưởng đến việc tốt nghiệp và các yêu cầu bắt buộc khác.</p>\n<p></p>\n<p>Môn học tự chọn: Khi đăng ký các môn học tự chọn, sinh viên nên xem xét kỹ các yêu cầu tiên quyết (nếu có), nội dung của môn học, và cách tính điểm. Họ cũng nên tham khảo ý kiến từ giáo viên hướng dẫn hoặc cố vấn học tập để đảm bảo rằng môn học này phù hợp với mục tiêu học tập và sự nghiệp của mình.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:40:23.429Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:19:18.294Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b2d98db4319f18dabfe5"
  },
  "title": "Học phần tiên quyết và học phần song hành",
  "content": "<p>Học phần tiên quyết và học phần song hành có vai trò gì trong quy trình đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Học phần tiên quyết (Prerequisite):</p>\n<p></p>\n<p>Vai trò: Đây là những môn học mà sinh viên cần phải hoàn thành và đạt điểm đủ để có thể đăng ký môn học tiếp theo. Học phần tiên quyết đặt nền tảng kiến thức và kỹ năng cần thiết để học một môn học khác một cách hiệu quả.</p>\n<p>Quy định: Sinh viên phải đáp ứng các yêu cầu về học phần tiên quyết trước khi được phép đăng ký môn học tiếp theo. Nếu không đáp ứng đủ các yêu cầu này, hệ thống đăng ký có thể không cho phép sinh viên đăng ký môn học.</p>\n<p>Học phần song hành (Corequisite):</p>\n<p></p>\n<p>Vai trò: Đây là những môn học mà sinh viên cần phải đăng ký và học cùng một lúc với một môn học khác. Học phần song hành thường cần thiết để bổ sung kiến thức và kỹ năng cần thiết để thành công trong môn học chính.</p>\n<p>Quy định: Sinh viên cần đăng ký cả hai học phần song hành và học phần chính cùng một lúc. Việc này giúp đảm bảo rằng sinh viên có đủ kiến thức và năng lực để theo kịp nội dung giảng dạy và yêu cầu của môn học chính.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:42:25.304Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:25:45.926Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b3408db4319f18dabfec"
  },
  "title": "Sự hỗ trợ từ nhà trường",
  "content": "<p>Nhà trường cung cấp những dịch vụ hỗ trợ gì để giúp sinh viên đăng ký môn học dễ dàng hơn?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Hệ thống đăng ký môn học trực tuyến: Nhà trường cung cấp một hệ thống đăng ký môn học trực tuyến tiện lợi và dễ sử dụng, giúp sinh viên có thể truy cập từ bất kỳ đâu và đăng ký các môn học một cách thuận tiện.</p>\n<p></p>\n<p>Thông tin và hướng dẫn đăng ký: Nhà trường cung cấp các tài liệu hướng dẫn chi tiết về quy trình đăng ký môn học, bao gồm các bước cần thiết và các lịch trình quan trọng. Thông tin này giúp sinh viên hiểu rõ hơn về quy trình và làm thế nào để hoàn thành đăng ký môn học một cách chính xác.</p>\n<p></p>\n<p>Hỗ trợ từ cố vấn học tập: Các cố vấn học tập của nhà trường có thể cung cấp hỗ trợ và lời khuyên cho sinh viên về việc đăng ký môn học. Họ có thể giúp sinh viên hiểu rõ hơn về các yêu cầu tiên quyết, lựa chọn môn học phù hợp với nhu cầu và mục tiêu học tập của mình.</p>\n<p></p>\n<p>Các buổi hướng dẫn và đào tạo: Nhà trường có thể tổ chức các buổi hướng dẫn và đào tạo đặc biệt về việc đăng ký môn học cho sinh viên mới và sinh viên có nhu cầu. Điều này giúp sinh viên hiểu rõ hơn về các quy trình và hỗ trợ có sẵn để đăng ký môn học.</p>\n<p></p>\n<p>Hỗ trợ kỹ thuật: Cung cấp hỗ trợ kỹ thuật cho sinh viên khi gặp phải vấn đề về hệ thống đăng ký môn học trực tuyến, bao gồm các lỗi kỹ thuật hoặc khó khăn trong việc sử dụng các công cụ liên quan đến đăng ký môn học.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:24:23.688Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:27:28.055Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b3b361f943f5f8a11505"
  },
  "title": "Công cụ và hệ thống đăng ký môn học",
  "content": "<p>Sinh viên sử dụng những công cụ và hệ thống nào để đăng ký môn học và cần lưu ý điều gì khi sử dụng?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Sinh viên thường sử dụng các công cụ và hệ thống sau để đăng ký môn học:</p>\n<p></p>\n<p>Hệ thống đăng ký môn học trực tuyến của trường: Đây là công cụ chính mà sinh viên sử dụng để đăng ký và quản lý các môn học của mình. Hệ thống này thường cung cấp các tùy chọn để xem thông tin về các môn học, đăng ký, rút đăng ký, và chỉnh sửa đăng ký.</p>\n<p></p>\n<p>Trang web của trường: Trang web của trường cũng cung cấp thông tin chi tiết về các chương trình học, các yêu cầu tiên quyết, lịch trình đăng ký, và các tài liệu hướng dẫn liên quan đến việc đăng ký môn học.</p>\n<p></p>\n<p>Email và thông báo từ phía trường: Sinh viên nhận được thông tin qua email và thông báo từ phía trường về các thay đổi quan trọng, các lịch trình đăng ký, hoặc các hướng dẫn đăng ký môn học.</p>\n<p></p>\n<p>Khi sử dụng các công cụ và hệ thống này để đăng ký môn học, sinh viên cần lưu ý các điều sau:</p>\n<p></p>\n<p>Thời gian đăng ký: Theo dõi thời gian mở đăng ký môn học và thời hạn đăng ký để đảm bảo không bỏ lỡ cơ hội đăng ký các môn học mong muốn.</p>\n<p></p>\n<p>Yêu cầu tiên quyết: Kiểm tra và đảm bảo rằng đã hoàn thành các môn học tiên quyết cần thiết trước khi đăng ký môn học tiếp theo. Hệ thống đăng ký thường sẽ kiểm tra điều này và không cho phép đăng ký nếu không đáp ứng yêu cầu tiên quyết.</p>\n<p></p>\n<p>Lịch trình và thời gian: Xác định các môn học có trùng lịch hoặc xung đột với nhau để tránh tình trạng môn học trùng lịch.</p>\n<p></p>\n<p>Các thông tin quan trọng: Đọc kỹ và hiểu các thông tin được cung cấp bởi hệ thống đăng ký và trang web của trường để đảm bảo việc đăng ký môn học diễn ra một cách chính xác và suôn sẻ.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:27:29.901Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:29:23.251Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694b44f61f943f5f8a115a1"
  },
  "title": "Lịch học và lịch thi",
  "content": "<p>Sinh viên có thể xem và quản lý lịch học và lịch thi như thế nào sau khi hoàn tất đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Hệ thống đăng ký môn học của trường:</p>\n<p></p>\n<p>Hệ thống này thường cung cấp cho sinh viên thông tin chi tiết về lịch học của từng môn học đã đăng ký, bao gồm thời gian, địa điểm, và giảng viên.</p>\n<p>Sinh viên có thể truy cập vào hệ thống đăng ký môn học để xem và kiểm tra lịch học của từng môn học trong học kỳ.</p>\n<p>Lịch học và lịch thi trên trang web của trường:</p>\n<p></p>\n<p>Trang web của trường thường cập nhật các thông tin về lịch học và lịch thi cho sinh viên. Sinh viên có thể truy cập vào phần mục lịch học hoặc lịch thi để xem thông tin chi tiết và các thay đổi mới nhất.</p>\n<p>Ứng dụng di động của trường (nếu có):</p>\n<p></p>\n<p>Một số trường cung cấp các ứng dụng di động để sinh viên có thể truy cập vào lịch học và lịch thi trên điện thoại di động của mình. Các ứng dụng này thường cung cấp tính năng thông báo để sinh viên nhận được thông tin mới nhất và các thay đổi nhanh chóng.</p>\n<p>Email và thông báo từ phía trường:</p>\n<p></p>\n<p>Sinh viên cũng có thể nhận được thông tin về lịch học và lịch thi thông qua email và các thông báo từ phía trường. Điều này giúp sinh viên cập nhật và chuẩn bị kế hoạch học tập một cách hiệu quả.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:30:53.295Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T05:31:59.806Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c2aec0ab8d672d2c773c"
  },
  "title": "Đăng ký lại môn học",
  "content": "<p>Trường có cung cấp các khóa học hè và quy trình đăng ký như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 2,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Loại hình khóa học:</p>\n<p></p>\n<p>Các khóa học hè thường bao gồm các môn học cụ thể hoặc các chương trình đặc biệt nhằm cung cấp cho sinh viên các cơ hội học tập bổ sung ngoài chương trình học kỳ chính.</p>\n<p>Nội dung và thời gian:</p>\n<p></p>\n<p>Các khóa học hè có thể bao gồm các môn học về các lĩnh vực chuyên ngành, các khoá đào tạo ngắn hạn, hoặc các hoạt động học tập bổ ích khác.</p>\n<p>Thời gian thường linh động và có thể kéo dài từ vài tuần đến một tháng, tuỳ thuộc vào nhu cầu và lịch trình của từng khóa học.</p>\n<p>Lợi ích của khóa học hè:</p>\n<p></p>\n<p>Các khóa học hè thường giúp sinh viên:</p>\n<p>Nâng cao kiến thức và kỹ năng chuyên môn.</p>\n<p>Đáp ứng các yêu cầu học tập bổ sung.</p>\n<p>Tăng cường kinh nghiệm thực tế trong lĩnh vực mong muốn.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:36:42.499Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T06:33:18.305Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694c3eafc1c9b04c93060fd"
  },
  "title": "Đăng ký lại môn học",
  "content": "<p>Quy định về đăng ký lại môn học sau khi không đạt điểm đậu là gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 3,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [
    {
      "$oid": "66929cdd1561c2b1a4cc2cff"
    }
  ],
  "answer": {
    "content": "<p>Yêu cầu và điều kiện:</p>\n<p></p>\n<p>Sinh viên cần phải đăng ký lại môn học nếu không đạt điểm đậu hoặc điểm tối thiểu được quy định.</p>\n<p>Thường có các điều kiện cụ thể về số lần được phép đăng ký lại môn học, thời gian giữa các lần đăng ký lại, và điều kiện tiên quyết nếu có.</p>\n<p>Quy trình đăng ký lại:</p>\n<p></p>\n<p>Đăng ký lại môn học thường được thực hiện thông qua hệ thống đăng ký môn học của trường.</p>\n<p>Sinh viên cần tuân thủ các thời hạn và quy định đăng ký lại môn học được thông báo trước bởi phòng đào tạo hoặc bộ phận chuyên trách.</p>\n<p>Phí đăng ký lại:</p>\n<p></p>\n<p>Có thể có phí đăng ký lại môn học mà sinh viên cần phải thanh toán khi đăng ký lại môn học không đạt điểm đậu.</p>\n<p>Hạn chế và hỗ trợ:</p>\n<p></p>\n<p>Các trường có thể áp dụng các hạn chế về số lần được phép đăng ký lại môn học.</p>\n<p>Có thể có các chương trình hỗ trợ học tập để giúp sinh viên chuẩn bị tốt hơn cho lần đăng ký lại môn học.</p>\n<p>Quy định đối với điểm số và học phí:</p>\n<p></p>\n<p>Quy định về việc điểm số của lần đăng ký lại sẽ được áp dụng và có thể có ảnh hưởng đến học phí, chương trình học tập và tiến độ học tập của sinh viên.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T06:42:43.919Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T06:38:34.583Z"
  },
  "__v": 1
},
{
  "_id": {
    "$oid": "6694c52ffc1c9b04c930623f"
  },
  "title": "Hướng dẫn đăng ký môn học cho sinh viên năm nhất",
  "content": "<p>Những hướng dẫn cụ thể nào được cung cấp cho sinh viên năm nhất khi đăng ký môn học lần đầu tiên?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "privately-answered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T06:43:59.349Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694cc06fc1c9b04c9306707"
  },
  "title": "Đăng ký môn học cho sinh viên quốc tế",
  "content": "<p>Quy trình đăng ký môn học có khác biệt đối với sinh viên quốc tế không?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": true,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65dc93823a43bf67107ca57d"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T07:13:10.393Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6694cfc5fc1c9b04c9306977"
  },
  "title": "Phí đăng ký môn học",
  "content": "<p>Sinh viên cần biết về các khoản phí liên quan đến đăng ký môn học như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Học phí cho từng môn học:</p>\n<p>Mức học phí: Mỗi môn học có mức học phí khác nhau, tùy thuộc vào số tín chỉ, cấp độ môn học (cơ bản hay nâng cao), và ngành học.</p>\n<p>Cách tính học phí: Học phí thường được tính dựa trên số tín chỉ của môn học. Ví dụ, nếu một tín chỉ có giá 500.000 VND và môn học có 3 tín chỉ, học phí của môn học đó sẽ là 1.500.000 VND.</p>\n<p>2. Phí đăng ký lại môn học:</p>\n<p>Sinh viên có thể phải trả thêm phí nếu phải đăng ký lại một môn học do không đạt yêu cầu. Mức phí này thường tương đương với học phí của môn học đó hoặc có thể thấp hơn, tùy theo chính sách của trường.</p>\n<p>3. Phí bổ sung và thay đổi môn học:</p>\n<p>Có thể có phí bổ sung khi sinh viên thêm hoặc thay đổi môn học sau thời hạn đăng ký chính thức. Mức phí này tùy thuộc vào quy định của từng trường.</p>\n<p>4. Phí tài liệu học tập và sách giáo khoa:</p>\n<p>Ngoài học phí, sinh viên cần chi trả cho tài liệu học tập, sách giáo khoa, và các tài liệu bổ sung khác. Một số môn học có thể yêu cầu mua sách hoặc tài liệu đặc thù.</p>\n<p>5. Phí dịch vụ và hỗ trợ học tập:</p>\n<p>Một số trường có thể áp dụng các phí dịch vụ cho việc sử dụng phòng thí nghiệm, phòng máy tính, hoặc các dịch vụ hỗ trợ học tập khác. Những khoản phí này có thể tính riêng lẻ hoặc gộp chung vào học phí.</p>\n<p>6. Phí bảo hiểm và y tế:</p>\n<p>Một số trường yêu cầu sinh viên đóng phí bảo hiểm y tế hoặc các phí liên quan đến dịch vụ y tế của trường. Đây thường là khoản phí bắt buộc đối với tất cả sinh viên.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T14:56:17.891Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T07:29:09.886Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952d450cff36b7375c71c2"
  },
  "title": "Phí đăng ký môn học",
  "content": "<p>Sinh viên cần biết về các khoản phí liên quan đến đăng ký môn học như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Học phí cho từng môn học:</p>\n<p>Mức học phí: Mỗi môn học có mức học phí khác nhau, tùy thuộc vào số tín chỉ, cấp độ môn học (cơ bản hay nâng cao), và ngành học.</p>\n<p>Cách tính học phí: Học phí thường được tính dựa trên số tín chỉ của môn học. Ví dụ, nếu một tín chỉ có giá 500.000 VND và môn học có 3 tín chỉ, học phí của môn học đó sẽ là 1.500.000 VND.</p>\n<p>2. Phí đăng ký lại môn học:</p>\n<p>Sinh viên có thể phải trả thêm phí nếu phải đăng ký lại một môn học do không đạt yêu cầu. Mức phí này thường tương đương với học phí của môn học đó hoặc có thể thấp hơn, tùy theo chính sách của trường.</p>\n<p>3. Phí bổ sung và thay đổi môn học:</p>\n<p>Có thể có phí bổ sung khi sinh viên thêm hoặc thay đổi môn học sau thời hạn đăng ký chính thức. Mức phí này tùy thuộc vào quy định của từng trường.</p>\n<p>4. Phí tài liệu học tập và sách giáo khoa:</p>\n<p>Ngoài học phí, sinh viên cần chi trả cho tài liệu học tập, sách giáo khoa, và các tài liệu bổ sung khác. Một số môn học có thể yêu cầu mua sách hoặc tài liệu đặc thù.</p>\n<p>5. Phí dịch vụ và hỗ trợ học tập:</p>\n<p>Một số trường có thể áp dụng các phí dịch vụ cho việc sử dụng phòng thí nghiệm, phòng máy tính, hoặc các dịch vụ hỗ trợ học tập khác. Những khoản phí này có thể tính riêng lẻ hoặc gộp chung vào học phí.</p>\n<p>6. Phí bảo hiểm và y tế:</p>\n<p>Một số trường yêu cầu sinh viên đóng phí bảo hiểm y tế hoặc các phí liên quan đến dịch vụ y tế của trường. Đây thường là khoản phí bắt buộc đối với tất cả sinh viên.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6693c4db0615bc677a88bad2"
    },
    "answeredAt": {
      "$date": "2024-07-15T14:56:32.743Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T14:08:05.323Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952d580cff36b7375c71cf"
  },
  "title": "Thông tin về môn học",
  "content": "<p>Sinh viên có thể tìm thấy thông tin chi tiết về môn học như giảng viên phụ trách, nội dung môn học và tài liệu học liệu ở đâu?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>1. Trang web của trường hoặc cổng thông tin sinh viên:</p>\n<p>Hệ thống quản lý học tập (LMS): Nhiều trường đại học sử dụng hệ thống quản lý học tập như Moodle, Blackboard, hoặc Canvas. Sinh viên có thể đăng nhập vào hệ thống này để xem thông tin chi tiết về môn học, giảng viên, nội dung môn học, và tài liệu học tập.</p>\n<p>Trang đăng ký môn học: Thường có phần mô tả chi tiết về các môn học bao gồm mục tiêu, nội dung chính, lịch trình, và các yêu cầu cần thiết.</p>\n<p>2. Sổ tay sinh viên hoặc tài liệu hướng dẫn học tập:</p>\n<p>Các trường thường phát hành sổ tay sinh viên hoặc tài liệu hướng dẫn học tập, trong đó có mô tả chi tiết về các môn học, yêu cầu đầu vào, giảng viên, và các tài liệu cần thiết.</p>\n<p>3. Phòng đào tạo hoặc văn phòng khoa:</p>\n<p>Sinh viên có thể liên hệ trực tiếp với phòng đào tạo hoặc văn phòng khoa để nhận thông tin chi tiết về môn học. Nhân viên ở đây có thể cung cấp các tài liệu, hướng dẫn, và thông tin cụ thể về các khóa học và giảng viên.</p>\n<p>4. Thư viện trường:</p>\n<p>Thư viện thường có các tài liệu tham khảo và sách giáo khoa cần thiết cho các môn học. Ngoài ra, thư viện còn cung cấp các dịch vụ tìm kiếm tài liệu và hỗ trợ học tập.</p>\n<p>5. Liên hệ trực tiếp với giảng viên:</p>\n<p>Sinh viên có thể liên hệ trực tiếp với giảng viên phụ trách môn học qua email hoặc trong giờ hành chính để hỏi về nội dung môn học, tài liệu tham khảo, và các yêu cầu khác.</p>\n<p>6. Các buổi giới thiệu và tư vấn học tập:</p>\n<p>Trường thường tổ chức các buổi giới thiệu và tư vấn học tập vào đầu mỗi học kỳ để giúp sinh viên hiểu rõ về các môn học, lịch trình học tập, và các tài liệu cần thiết. Sinh viên nên tham gia các buổi này để có được thông tin cụ thể và chính xác.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6694ad6bc368e7498824fa1e"
    },
    "answeredAt": {
      "$date": "2024-07-15T14:58:22.075Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T14:08:24.912Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952d6a0cff36b7375c71dc"
  },
  "title": "Thủ tục hủy môn học",
  "content": "<p>Quy trình hủy môn học khi sinh viên muốn thay đổi lựa chọn môn học đã đăng ký là gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "publicly-answered-and-approved",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": {
    "content": "<p>Bước 1: Kiểm tra thời hạn hủy môn học</p>\n<p>Thời hạn hủy môn: Trước tiên, sinh viên cần kiểm tra thời hạn hủy môn học được quy định bởi trường. Thông tin này thường được công bố trên trang web của trường, cổng thông tin sinh viên, hoặc trong sổ tay sinh viên.</p>\n<p>Phí hủy môn: Kiểm tra xem có phí hủy môn học không và các quy định về hoàn trả học phí (nếu có).</p>\n<p>Bước 2: Đăng nhập vào hệ thống đăng ký môn học</p>\n<p>Hệ thống trực tuyến: Sinh viên cần đăng nhập vào hệ thống đăng ký môn học trực tuyến của trường (ví dụ: cổng thông tin sinh viên, hệ thống quản lý học tập).</p>\n<p>Tìm danh sách môn học: Truy cập vào phần quản lý môn học hoặc danh sách các môn học đã đăng ký.</p>\n<p>Bước 3: Chọn môn học cần hủy</p>\n<p>Lựa chọn môn học: Tìm và chọn môn học mà bạn muốn hủy từ danh sách các môn học đã đăng ký.</p>\n<p>Xác nhận hủy môn: Thường có một nút hoặc liên kết để hủy môn học. Sinh viên cần nhấp vào đó và xác nhận hành động hủy môn.</p>\n<p>Bước 4: Kiểm tra và xác nhận</p>\n<p>Kiểm tra lịch học: Sau khi hủy môn học, sinh viên nên kiểm tra lại lịch học của mình để đảm bảo rằng thay đổi đã được cập nhật.</p>\n<p>Xác nhận hủy môn: Kiểm tra lại trên hệ thống để đảm bảo rằng môn học đã được hủy thành công. Có thể nhận được email hoặc thông báo xác nhận từ hệ thống.</p>\n<p>Bước 5: Thông báo cho giảng viên (nếu cần)</p>\n<p>Thông báo giảng viên: Một số trường yêu cầu sinh viên thông báo cho giảng viên của môn học về việc hủy môn. Điều này có thể thực hiện qua email hoặc trực tiếp trong giờ làm việc của giảng viên.</p>\n<p>Bước 6: Đăng ký môn học mới (nếu cần)</p>\n<p>Đăng ký môn mới: Nếu sinh viên muốn thay đổi môn học, họ cần thực hiện quy trình đăng ký môn học mới thông qua hệ thống đăng ký môn học của trường.</p>\n<p>Kiểm tra xung đột lịch học: Đảm bảo rằng môn học mới không xung đột với các môn học khác đã đăng ký.</p>\n<p>Bước 7: Liên hệ với phòng đào tạo hoặc cố vấn học tập (nếu cần)</p>\n<p>Hỗ trợ thêm: Nếu gặp bất kỳ khó khăn nào trong quá trình hủy môn học, sinh viên nên liên hệ với phòng đào tạo hoặc cố vấn học tập để được hỗ trợ và giải đáp thắc mắc.</p>\n",
    "file": {
      "ref": null,
      "url": null
    },
    "user": {
      "$oid": "6694ad6bc368e7498824fa1e"
    },
    "answeredAt": {
      "$date": "2024-07-15T15:00:50.801Z"
    }
  },
  "createdAt": {
    "$date": "2024-07-15T14:08:42.812Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952d890cff36b7375c71e9"
  },
  "title": "Đăng ký môn học sau khi hết hạn",
  "content": "<p>Có thể đăng ký môn học sau khi hết hạn đăng ký được không và quy trình như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:09:13.167Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952da90cff36b7375c71f6"
  },
  "title": "Chính sách về số lượng tín chỉ tối đa đăng ký",
  "content": "<p>Có giới hạn số lượng tín chỉ sinh viên có thể đăng ký mỗi học kỳ không và nếu có thì giới hạn đó là bao nhiêu?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:09:45.230Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952e5d0cff36b7375c7203"
  },
  "title": "Quy trình đăng ký môn học cho sinh viên chuyển tiếp",
  "content": "<p>Sinh viên chuyển tiếp từ các trường khác cần tuân theo quy trình đăng ký môn học như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-06-15T14:12:45.869Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952e7d0cff36b7375c7210"
  },
  "title": "Hướng dẫn đăng ký môn học cho sinh viên chương trình liên kết",
  "content": "<p>Các hướng dẫn cụ thể nào được cung cấp cho sinh viên theo chương trình liên kết khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-06-15T14:13:17.310Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952e970cff36b7375c721d"
  },
  "title": "Đăng ký môn học trong trường hợp đặc biệt",
  "content": "<p>Điều kiện và quy trình đăng ký môn học trong trường hợp sinh viên có nhu cầu đặc biệt như học cùng một lớp với bạn bè, hay học môn học ngoài chương trình chính.</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-06-15T14:13:43.288Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952eae0cff36b7375c722a"
  },
  "title": "Thông tin về lịch học và phòng học",
  "content": "<p>Sinh viên có thể tra cứu thông tin về lịch học và phòng học của môn học đã đăng ký ở đâu?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:14:06.710Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952ec00cff36b7375c7237"
  },
  "title": "Đăng ký môn học trong thời gian nghỉ hè",
  "content": "<p>Sinh viên có thể đăng ký môn học trong thời gian nghỉ hè không và nếu có thì quy trình đăng ký như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:14:24.821Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952ee50cff36b7375c7244"
  },
  "title": "Quy định về đăng ký lại môn học khi chưa đủ điểm",
  "content": "<p>Quy định về việc đăng ký lại môn học khi sinh viên chưa đạt điểm qua môn là gì và sinh viên cần tuân theo những quy định nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:15:01.583Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952ef40cff36b7375c7251"
  },
  "title": "Đăng ký môn học cho sinh viên bị hạn chế",
  "content": "<p>Các hướng dẫn đăng ký môn học dành cho sinh viên bị hạn chế về sức khỏe hoặc các yêu cầu đặc biệt khác.</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-05-15T14:15:16.826Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f050cff36b7375c725e"
  },
  "title": "Thay đổi đăng ký môn học sau khi bắt đầu học kỳ",
  "content": "<p>Quy trình và điều kiện để thay đổi đăng ký môn học sau khi đã bắt đầu học kỳ là gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:15:33.319Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f140cff36b7375c726b"
  },
  "title": "Đăng ký môn học và quy tắc ưu tiên",
  "content": "<p>Có quy tắc ưu tiên đăng ký môn học cho sinh viên những năm cuối không và nếu có thì quy tắc ưu tiên đó như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:15:48.592Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f2b0cff36b7375c7278"
  },
  "title": "Hướng dẫn sử dụng hệ thống đăng ký môn học",
  "content": "<p>Sinh viên cần phải làm gì để sử dụng hệ thống đăng ký môn học của trường một cách hiệu quả?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:16:11.013Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f3b0cff36b7375c7285"
  },
  "title": "Đăng ký môn học trong các học kỳ mùa",
  "content": "<p>Quy trình đăng ký môn học trong các học kỳ mùa (học kỳ mùa hè, mùa đông) là gì và có những đặc điểm khác biệt so với học kỳ chính?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:16:27.428Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f5d0cff36b7375c7292"
  },
  "title": "Lựa chọn môn học cho học kỳ tiếp theo",
  "content": "<p>Sinh viên cần làm gì để lựa chọn môn học cho học kỳ tiếp theo và cần lưu ý điều gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:17:01.642Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952f6c0cff36b7375c729f"
  },
  "title": "Đăng ký môn học cho sinh viên chương trình thạc sĩ và tiến sĩ",
  "content": "<p>Quy trình đăng ký môn học có khác biệt như thế nào đối với sinh viên chương trình thạc sĩ và tiến sĩ?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:17:16.352Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952fd90cff36b7375c72ac"
  },
  "title": "Đăng ký môn học cho sinh viên chương trình thạc sĩ và tiến sĩ",
  "content": "<p>Quy trình đăng ký môn học có khác biệt như thế nào đối với sinh viên chương trình thạc sĩ và tiến sĩ?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:19:05.980Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952fe90cff36b7375c72b9"
  },
  "title": "Thủ tục đăng ký môn học bằng giấy tờ",
  "content": "<p>Có những thủ tục đăng ký môn học bằng giấy tờ nào và sinh viên cần chuẩn bị những giấy tờ gì?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:19:21.597Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "66952ff90cff36b7375c72c6"
  },
  "title": "Đăng ký môn học trước khi học phí",
  "content": "<p>Sinh viên có thể đăng ký môn học trước khi thanh toán học phí không và nếu có thì quy trình đăng ký như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:19:37.980Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695300d0cff36b7375c72d3"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên chuyển ngành",
  "content": "<p>Sinh viên chuyển ngành cần tuân theo những thủ tục gì khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:19:57.386Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530210cff36b7375c72e1"
  },
  "title": "Thủ tục đăng ký môn học khi bị hạn chế về điểm",
  "content": "<p>Sinh viên bị hạn chế về điểm cần tuân theo những thủ tục gì khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:20:17.134Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695305f0cff36b7375c72ee"
  },
  "title": "Thời gian bổ sung môn học",
  "content": "<p>Có thời gian bổ sung để sinh viên có thể thêm môn học sau khi hoàn tất đăng ký không và nếu có thì thời gian bổ sung như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:21:19.644Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530980cff36b7375c72fb"
  },
  "title": "Thời gian bổ sung môn học",
  "content": "<p>Có thời gian bổ sung để sinh viên có thể thêm môn học sau khi hoàn tất đăng ký không và nếu có thì thời gian bổ sung như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:22:16.548Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530a40cff36b7375c7308"
  },
  "title": "Thủ tục đăng ký môn học bằng hệ thống SMS",
  "content": "<p>Có hệ thống đăng ký môn học qua SMS và quy trình như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:22:28.049Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530b70cff36b7375c7315"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên làm thêm",
  "content": "<p>Sinh viên làm thêm cần tuân theo những thủ tục gì khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:22:47.457Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530c70cff36b7375c7322"
  },
  "title": "Đăng ký môn học cho sinh viên học phần tiên quyết ở trường khác",
  "content": "<p>Sinh viên cần tuân theo những thủ tục gì khi đăng ký môn học ở trường khác là môn học tiên quyết?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:23:03.640Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669530dd0cff36b7375c732f"
  },
  "title": "Quy trình đăng ký môn học cho sinh viên học cùng lớp với bạn bè",
  "content": "<p>Sinh viên muốn đăng ký cùng lớp với bạn bè cần làm thủ tục như thế nào?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:23:25.962Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669531380cff36b7375c733c"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên nghỉ học phần",
  "content": "<p>Sinh viên nghỉ học phần cần làm thủ tục như thế nào để đăng ký lại môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:24:56.033Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695314c0cff36b7375c7349"
  },
  "title": "Đăng ký môn học trong trường hợp bất khả kháng",
  "content": "<p>Sinh viên gặp phải các trường hợp bất khả kháng như tai nạn, bệnh tật cần làm thủ tục như thế nào để đăng ký lại môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:25:16.404Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669531830cff36b7375c7356"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên bị thay đổi điều kiện học tập",
  "content": "<p>Sinh viên bị thay đổi điều kiện học tập cần làm thủ tục như thế nào để đăng ký lại môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:26:11.050Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669531f60cff36b7375c7363"
  },
  "title": "Quy trình đăng ký môn học cho sinh viên tham gia các hoạt động ngoại khóa",
  "content": "<p>Sinh viên tham gia các hoạt động ngoại khóa cần tuân theo những thủ tục gì khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:28:06.821Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "669532040cff36b7375c7370"
  },
  "title": "Đăng ký môn học cho sinh viên tham gia các chương trình học tập quốc tế",
  "content": "<p>Sinh viên tham gia các chương trình học tập quốc tế cần làm thủ tục như thế nào khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:28:20.807Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695327c0cff36b7375c737f"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên tham gia các dự án nghiên cứu khoa học",
  "content": "<p>Sinh viên tham gia các dự án nghiên cứu khoa học cần tuân theo những thủ tục gì khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:30:20.783Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695328d0cff36b7375c738c"
  },
  "title": "Đăng ký môn học trong các chương trình đào tạo chất lượng cao",
  "content": "<p>Sinh viên tham gia các chương trình đào tạo chất lượng cao cần làm thủ tục như thế nào khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:30:37.837Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6695329d0cff36b7375c7399"
  },
  "title": "Thủ tục đăng ký môn học cho sinh viên có nhu cầu học môn học bổ trợ",
  "content": "<p>Sinh viên có nhu cầu học môn học bổ trợ cần làm thủ tục như thế nào khi đăng ký môn học?</p>\n",
  "file": {
    "ref": null,
    "url": null
  },
  "status": "unanswered",
  "views": 0,
  "isForwarded": false,
  "user": {
    "$oid": "66929cdd1561c2b1a4cc2cff"
  },
  "department": {
    "$oid": "65d87158b394abe04aad269c"
  },
  "field": {
    "$oid": "6694a3bad20ce5e772cc9c7e"
  },
  "likes": [],
  "answer": null,
  "createdAt": {
    "$date": "2024-07-15T14:30:53.192Z"
  },
  "__v": 0
}]